Repository: shadigaafar/musahimoun
Catalog: languages/musahimoun-*.po
Languages: ar

source: You can not delete default role.
ar: لا يمكنك حذف الدور الافتراضي.

source: Are you sure you want to delete this role?
ar: هل أنت متأكد أنك تريد حذف هذا الدور؟

source: Role deleted successfully.
ar: تم حذف الدور بنجاح.

source: Failed to delete role.
ar: فشل في حذف الدور.

source: An error occurred while deleting the role.
ar: حدث خطأ أثناء حذف الدور.

source: No role selected to delete.
ar: لم يتم تحديد أي دور للحذف.

source: Save Settings
ar: حفظ الإعدادات

source: Optional search term to filter users and guest authors by name.
ar: مصطلح بحث اختياري لتصفية المستخدمين والكتّاب المستضافين حسب اسم.

source: Optional to filter users and guests by IDs
ar: اختياري لتصفية المستخدمين والمستضافين حسب المُعرّفات

source: This plugin will not work with non-block themes. Please switch to a block theme for full functionality.
ar: لن تعمل هذه الإضافة مع القوالب غير المدعومة بالكتل. يرجى التبديل إلى قالب مدعوم بالكتل للحصول على كافة الوظائف.

source: Author
ar: كاتب

source: Written by
ar: كَتبه

source: Width
ar: العُرض

source: Border
ar: الحد

source: Radius
ar: نصف القطر

source: Contributor Bio
ar: سيرة المساهم

source: Contributor Name
ar: اسم المساهم

source: Link Settings
ar: إعدادات الرابط

source: Link to Contributor Archive
ar: رابط إلى أرشيف المساهم

source: Open in New Tab
ar: فتح في تبويب جديد

source: Search...
ar: بحث...

source: Assign Contributors to Roles
ar: تعيين المساهمين للأدوار

source: Add Another Role
ar: إضافة دور آخر

source: --Select Role--
ar: --اختيار الدور--

source: SELECTED CONTRIBUTORS:
ar: المساهمون المختارون:

source: Role Prefix:
ar: بادئة الدور:

# block title
source: Musahimoun: Role Prefix
ar: مساهمون: بادئة الدور

# block keyword
source: role prefix
ar: بادئة الدور

source: Shadi gaafar
ar: شادي جعفر

source: Name
ar: الاسم

source: Posts
ar: المنشورات

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: User
ar: مستخدم

source: Are you sure you want to delete the selected contributor? This is permanent delete!
ar: هل أنت متأكد أنك تريد حذف المساهم المحدد؟ هذا حذف دائم!

source: Authors/Contributors
ar: الكتّاب/المساهمون

source: Author added successfully.
ar: تم إضافة الكاتب بنجاح.

source: Error adding author. Please try again.
ar: خطأ في إضافة الكاتب. يرجى المحاولة مرة أخرى.

source: Email
ar: البريد الإلكتروني

source: Description
ar: الوصف

source: Avatar
ar: الصورة الرمزية

source: Choose Image
ar: اختيار صورة

source: Choose Avatar
ar: اختيار الصورة الرمزية

source: Add New Guest Contributor
ar: إضافة مساهم مستضاف جديد

source: Add New Role
ar: إضافة دور جديد

source: Search Contributors
ar: بحث عن المساهمين

source: *Contributor is a general term here, it could be a writer, reviewer, proofreader, fact checker, etc.
ar: *المساهم هو مصطلح عام هنا، يمكن أن يكون كاتباً، مراجعاً، مدققاً لغوياً، مُحقق وقائع، إلخ.

source: Author updated successfully.
ar: تم تحديث الكاتب بنجاح.

source: Edit Guest Contributor
ar: تعديل المساهم المستضاف

source: Save Author
ar: حفظ الكاتب

source: Musahimoun: Contributors
ar: إضافة مساهمون: المساهمون

source: Musahimoun
ar: مساهمون

source: Settings
ar: الإعدادات

source: Role updated successfully.
ar: تم تحديث الدور بنجاح.

source: Error updating role. Please try again.
ar: خطأ في تحديث الدور. يرجى المحاولة مرة أخرى.

source: Role added successfully.
ar: تم إضافة الدور بنجاح.

source: Error adding role. Please try again.
ar: خطأ في إضافة الدور. يرجى المحاولة مرة أخرى.

source: Select Role
ar: تحديد دور

source: Loading...
ar: جار التحميل...

source: Loading role data...
ar: جار تحميل بيانات الدور...

source: You can name this role as you like, for example, "Fact-checker"
ar: يمكنك تسمية هذا الدور كما تشاء، على سبيل المثال، "مُحقق وقائع"

source: Prefix
ar: البادئة

source: The prefix is the text displayed on the frontend before the person's name to indicate their role. For example, you might use 'Fact-checked by' as a prefix to highlight the fact-checker's contribution.
ar: البادئة هي النص الذي يتم عرضه على الواجهة الأمامية قبل اسم الشخص للإشارة إلى دوره. على سبيل المثال، يمكنك استخدام 'تم تحقيق الوقائع بواسطة' كبادئة لتسليط الضوء على مساهمة مُحقق الوقائع.

source: Show Avatar
ar: عرض الصورة الرمزية

source: Check this box if you want to show the avatar of contributors under this role.
ar: حدد هذا المربع إذا كنت ترغب في عرض الصورة الرمزية للمساهمين تحت هذا الدور.

source: Role Icon
ar: أيقونة الدور

source: No icon selected.
ar: لم يتم اختيار أي أيقونة.

source: Select Icon
ar: اختيار أيقونة

source: Remove Icon
ar: إزالة الأيقونة

source: Choose an icon for this role from the media library.
ar: اختيار أيقونة لهذا الدور من مكتبة الوسائط.

source: Save Role
ar: حفظ الدور

source: Roles are useful for categorizing authors based on their specific functions within a post. For instance, if a post features an author and a separate fact checker, you can create distinct roles such as "Author" and "Fact Checker." When editing a post, you can then assign each person to their respective role, providing clarity on their contributions.
ar: تعد الأدوار مفيدة لتصنيف الكتاب بناءً على وظائفهم المحددة ضمن المنشور. على سبيل المثال، إذا كان المنشور يضم كاتباً ومُحقق وقائع منفصل، يمكنك إنشاء أدوار مميزة مثل "كاتب" و"مُحقق وقائع". عند تحرير المنشور، يمكنك بعد ذلك تعيين كل شخص إلى دوره المعين، مما يوفر وضوحاً حول مساهماتهم.

source: Delete Role
ar: حذف الدور

# block description
source: Displays Role Prefix for contributors
ar: يعرض بادئة الدور للمساهمين

# block keyword
source: role
ar: الدور

source: Add new contributor author
ar: إضافة مساهم جديد

source: Add new
ar: إضافة جديد

source: Contributor's Roles In Posts
ar: أدوار المساهمين في المنشورات\المقالات

source: Roles
ar: الأدوار

source: SELECT ROLE:
ar: تحديد دور

source: SEARCH CONTRIBUTOR:
ar: بحث بين المساهمين:

source: SELECT CONTRIBUTOR:
ar: تحديد مساهم:

source: Repetition
ar: التكرار

source: Should prefix be repeated for each contributor?
ar: أيجب أن تتكرر البادئة لكل مساهم؟

source: Show for each contributor
ar: اظهار لكل مساهم

source: Error updating author. Please try again.
ar: حدث خطأ أثناء عملية تحديث بيانات الكاتب. الرجاء المحاولة مرة أخرى.

source: This plugin allows you to choose an author, create a guest author or choose multiple authors and contributors..
ar: تسمح لك هذه الإضافة باختيار كاتب، أو إنشاء كاتب مستضاف أو العديد من الكُتّاب والمساهمين في المنشورات...

source: General
ar: عام

source: Select Post Types
ar: تحديد نوع المنشور\المحتوى

source: Author Archives Display
ar: أرشيف الكاتب يعرض

source: Select the post types and author archive settings for your site.
ar: اختيار أنواع المنشورات وضبط اعدادت أرشيف الكاتب لهذا الموقع.

source: Settings Saved
ar: تم حفظ الإعدادت

source: Contributors
ar: مساهمون

# Block pattern description
source: Basic Ready to use layout for authors/contributors
ar: تخطيط أساسي جاهز للاستعمال للكُتّاب/المساهمين

source: Security check failed.
ar: فشل التحقق الأمني.

source: Contributor row layout
ar: تخطيط صف المساهم

source: Contributor Box layout
ar: تخطيط صندوق المساهم

source: Mushahimoun
ar: مساهمون

source: Failed to load role data.
ar: فشل في تحميل بيانات الدور.

source: An error occurred while loading role data.
ar: حدث خطأ أثناء تحميل بيانات الدور.

source: Migration
ar: الترحيل

source: Migrate from other plugins
ar: ترحيل من إضافات أخرى

source: Migrate authors and avatars from other plugins (PublishPress Authors) to Musahimoun. Make sure PublishPress Authors plugin is activated before migration
ar: ترحيل الكتاب والصور الرمزية من إضافات أخرى (PublishPress Authors في الوقت الحالي فقط) إلى مساهمون. تأكد من تفعيل إضافة PublishPress Authors قبل الترحيل

source: Migrate Authors & Avatars
ar: ترحيل الكتاب والصور الرمزية

source: Migration completed.
ar: تم اكتمال الترحيل.

source: contributorSearch component: Error fetching contributors:
ar: مكوّن بحث المساهمين: خطأ في جلب المساهمين:
